output/posts/2017-08-09-summarizing-the-clocking-time-in-a-journal-entry.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Summarizing the clocking time in a journal entry | The journal that counts</title>
<link href="../assets/css/bootstrap.min.css" rel="stylesheet" type="text/css">
<link href="../assets/css/html4css1.css" rel="stylesheet" type="text/css">
<link href="../assets/css/nikola_rst.css" rel="stylesheet" type="text/css">
<link href="../assets/css/code.css" rel="stylesheet" type="text/css">
<link href="../assets/css/colorbox.css" rel="stylesheet" type="text/css">
<link href="../assets/css/theme.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../rss.xml">
<link rel="canonical" href="https://example.com/posts/2017-08-09-summarizing-the-clocking-time-in-a-journal-entry.html">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Pieter Swinkels">
<link rel="prev" href="2017-08-09-adding-the-time-of-a-journal-entry-as-a-property.html" title="Adding the time of a journal entry as a property" type="text/html">
<link rel="next" href="2017-08-10-org-clock-sum-and-the-time-range-parameters.html" title="org-clock-sum and the time range parameters" type="text/html">
<meta property="og:site_name" content="The journal that counts">
<meta property="og:title" content="Summarizing the clocking time in a journal entry">
<meta property="og:url" content="https://example.com/posts/2017-08-09-summarizing-the-clocking-time-in-a-journal-entry.html">
<meta property="og:description" content="Summarizing the clocking time in a journal entry


I would like to use org-mode and org-journal to keep track of the time worked
for a specific customer. A single journal entry could then register the">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-08-09T23:38:00+02:00">
<meta property="article:tag" content="emacs">
<meta property="article:tag" content="orgmode">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://example.com/">

                <span id="blog-title">The journal that counts</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../archive.html">Archive</a>
                </li>
<li>
<a href="../categories/index.html">Tags</a>
                </li>
<li>
<a href="../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="2017-08-09-summarizing-the-clocking-time-in-a-journal-entry.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="#" class="u-url">Summarizing the clocking time in a journal entry</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    <a href="../authors/pieter-swinkels.html">Pieter Swinkels</a>
            </span></p>
            <p class="dateline"><a href="#" rel="bookmark"><time class="published dt-published" datetime="2017-08-09T23:38:00+02:00" itemprop="datePublished" title="2017-08-09 23:38">2017-08-09 23:38</time></a></p>
            
        <p class="sourceline"><a href="2017-08-09-summarizing-the-clocking-time-in-a-journal-entry.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Summarizing the clocking time in a journal entry</h2>
<div class="outline-text-2" id="text-1">
<p>
I would like to use org-mode and org-journal to keep track of the time worked
for a specific customer. A single journal entry could then register the time
worked for that day, but also for other days.
</p>

<p>
org-mode stores the clocked work time in a so-called LOGBOOK drawer of a
headline. To give an example, the following LOGBOOK specifies I worked from
9:00 to 17:00 on Tuesday, August 8 2017:
</p>
<pre class="example">
:LOGBOOK:
CLOCK: [2017-08-08 Tue 22:45]--[2017-08-08 Tue 22:50] =&gt;  0:05
CLOCK: [2017-08-09 Wed 22:45]--[2017-08-09 Wed 22:50] =&gt;  0:05
:END:
</pre>
<p>
As mentioned, I would like to be able to clock more times in the same LOGBOOK.
</p>

<p>
Using Emacs function org-clock-report you can insert a clocking table with the
total clocking times in a certain time window. Although that function accepts a
lot of parameters to customize its output, I could not use it to create one
table that contained an overview of hours per day.
</p>

<p>
So I investigated how I could retrieve the required information
programmatically and build the table from that. It was quite a puzzle to find
out how to do that but the following two org-mode functions should make it
possible:
</p>
<ol class="org-ol">
<li>org-map-entries, which calls a given function on each headline in your
agenda files
</li>
<li>org-clock-sum-current-item, which returns the time clocked on the current
headline
</li>
</ol>
<p>
The following snippet shows how I used this functions to get an initial result:
</p>
<div class="highlight"><pre><span></span><span class="p">(</span><span class="nf">defun</span> <span class="nv">my-org-clock-sum-current-item</span> <span class="p">()</span>
  <span class="s">"Return time, clocked on current item in total."</span>
  <span class="p">(</span><span class="nf">save-excursion</span>
    <span class="p">(</span><span class="nf">save-restriction</span>
      <span class="p">(</span><span class="nf">org-narrow-to-subtree</span><span class="p">)</span>
      <span class="p">(</span><span class="nf">org-clock-sum</span> <span class="p">(</span><span class="nf">org-matcher-time</span> <span class="s">"2017-08-09"</span><span class="p">)</span> <span class="p">(</span><span class="nf">org-matcher-time</span> <span class="s">"2017-08-10"</span><span class="p">)))))</span>

<span class="p">(</span><span class="nf">org-map-entries</span> <span class="ss">'my-org-clock-sum-current-item</span> <span class="s">"emacs"</span> <span class="ss">'agenda</span><span class="p">)</span>
</pre></div>
<p>
The last call returns the list of total time clocked on August 9, 2017 for each
headline with tag "emacs".
</p>

<p>
For now, as a proof-of-concept, this suffices but we are not there yet. For
example, org-clock-report accepts a parameter that allows you to specify the
time window as a specific date, week, month etc. It would be nice if I could
also support this "block" parameter - note that org-clock-get-table-data
contains the code to parse this parameter.
</p>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../categories/emacs.html" rel="tag">emacs</a></li>
            <li><a class="tag p-category" href="../categories/orgmode.html" rel="tag">orgmode</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="2017-08-09-adding-the-time-of-a-journal-entry-as-a-property.html" rel="prev" title="Adding the time of a journal entry as a property">Previous post</a>
            </li>
            <li class="next">
                <a href="2017-08-10-org-clock-sum-and-the-time-range-parameters.html" rel="next" title="org-clock-sum and the time range parameters">Next post</a>
            </li>
        </ul></nav></aside></article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2017         <a href="mailto:swinkels.pieter@yahoo.com">Pieter Swinkels</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../assets/js/jquery.min.js"></script><script src="../assets/js/bootstrap.min.js"></script><script src="../assets/js/moment-with-locales.min.js"></script><script src="../assets/js/fancydates.js"></script><script src="../assets/js/jquery.colorbox-min.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
